0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 18.992285;

boundaryField
{

    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 18.992285;      
    }
    
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 18.992285;
    }

    External
    {
        type            inletOutlet;
        inletValue      uniform 18.992285; 
    }

    Wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    "(AMI_1|AMI_2)"
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
