system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   1;

purgeWrite      100;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           100;

functions
{

  yPlus1 // Y+ < 300
  {
      type        yPlus;
      libs        ("fieldFunctionObjects");
      writeControl    timeStep;
      writeInterval   100;
  }


  forces
  {
    type forces;
    libs ("libforces.so");
    patches (Wall); // sum the forces (thrust [kg] = force_z/g) and moments on those patches
    writeControl timeStep;
    writeInterval 1;
    p p;
    U U;
    log true;
    rhoInf 1000;
    rho rhoInf;
    CofR (0 0 0); //centreOfRotation
  }

}


// ************************************************************************* //
