system/decomposeParDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 
FoamFile
{
    version         2.0;
    format          ascii;
 
    root            "";
    case            "";
    instance        "";
    local           "";
 
    class           dictionary;
    object          decomposeParDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
 
numberOfSubdomains 12;
 
method          scotch;
 
simpleCoeffs
{
    n               (2 2 3);
    delta           0.001;
}

hierarchicalCoeffs
{
	n 				(1 1 1);
	delta 			0.001;
	order 			xyz;
}

metisCoeffs
{
}

manualCoeffs
{
	dataFile 		"";
}

distributed     no;
 
roots           
(
);
 
 
// ************************************************************************* //